## Plan Result (cft_test)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 0 to change, 7 to destroy.</code></pre>

* Replace
  * azurerm_key_vault_access_policy.this
  * azurerm_resource_group.this
  * azurerm_service_plan.this
  * azurerm_storage_account.this
  * azurerm_user_assigned_identity.this
  * azurerm_windows_function_app.this
  * module.application_insights.azurerm_application_insights.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.this must be replaced
-/+ resource "azurerm_key_vault_access_policy" "this" {
      - certificate_permissions = [] -> null
      ~ id                      = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/genesis-rg/providers/Microsoft.KeyVault/vaults/dcdcftappstestkv/objectId/65470ee0-2f8e-4efb-b95a-04175fe27ee9" -> (known after apply)
      - key_permissions         = [] -> null
      ~ object_id               = "65470ee0-2f8e-4efb-b95a-04175fe27ee9" # forces replacement -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (3 unchanged attributes hidden)
    }

  # azurerm_resource_group.this must be replaced
-/+ resource "azurerm_resource_group" "this" {
      ~ id       = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/alerts-slack-test" -> (known after apply)
      ~ name     = "alerts-slack-test" -> "alerts-slack-perftest" # forces replacement
        tags     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
            "startupMode"  = "always"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.this must be replaced
-/+ resource "azurerm_service_plan" "this" {
      ~ id                           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/alerts-slack-test/providers/Microsoft.Web/serverFarms/alerts-slack-test" -> (known after apply)
      ~ kind                         = "functionapp" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "alerts-slack-test" -> "alerts-slack-perftest" # forces replacement
      ~ reserved                     = false -> (known after apply)
      ~ resource_group_name          = "alerts-slack-test" -> "alerts-slack-perftest" # forces replacement
        tags                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
            "startupMode"  = "always"
        }
      ~ worker_count                 = 0 -> (known after apply)
      - zone_balancing_enabled       = false -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_storage_account.this must be replaced
-/+ resource "azurerm_storage_account" "this" {
      ~ access_tier                        = "Hot" -> (known after apply)
      ~ id                                 = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/alerts-slack-test/providers/Microsoft.Storage/storageAccounts/alertsslacktest" -> (known after apply)
      + large_file_share_enabled           = (known after apply)
      ~ name                               = "alertsslacktest" -> "alertsslackperftest" # forces replacement
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://alertsslacktest.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "alertsslacktest.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://alertsslacktest.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "alertsslacktest.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://alertsslacktest.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "alertsslacktest.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint             = "https://alertsslacktest.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "alertsslacktest.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://alertsslacktest.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "alertsslacktest.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://alertsslacktest.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "alertsslacktest.z33.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ resource_group_name                = "alerts-slack-test" -> "alerts-slack-perftest" # forces replacement
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
            "startupMode"  = "always"
        }
        # (17 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # azurerm_user_assigned_identity.this must be replaced
-/+ resource "azurerm_user_assigned_identity" "this" {
      ~ client_id           = "1a0c7fcb-d5f6-4165-bbcb-90197b700b87" -> (known after apply)
      ~ id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/alerts-slack-test/providers/Microsoft.ManagedIdentity/userAssignedIdentities/alerts-slack-test" -> (known after apply)
      ~ name                = "alerts-slack-test" -> "alerts-slack-perftest" # forces replacement
      ~ principal_id        = "65470ee0-2f8e-4efb-b95a-04175fe27ee9" -> (known after apply)
      ~ resource_group_name = "alerts-slack-test" -> "alerts-slack-perftest" # forces replacement
      - tags                = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-alert-to-slack-function"
          - "businessArea" = "CFT"
          - "environment"  = "testing"
        } -> null
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_windows_function_app.this must be replaced
-/+ resource "azurerm_windows_function_app" "this" {
      ~ app_settings                                   = {
          - "AZURE_CLIENT_ID"          = "1a0c7fcb-d5f6-4165-bbcb-90197b700b87"
          - "AzureWebJobsFeatureFlags" = "EnableWorkerIndexing"
          - "BOT_TOKEN_SECRET_NAME"    = "alerts-slack-bot-token"
          - "KEY_VAULT_NAME"           = "dcdcftappstestkv"
          - "SIGNING_SECRET_NAME"      = "alerts-slack-signing-secret"
          - "WEBSITE_RUN_FROM_PACKAGE" = "1"
        } -> (known after apply)
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "alerts-slack-test.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ https_only                                     = false -> (known after apply)
      ~ id                                             = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/alerts-slack-test/providers/Microsoft.Web/sites/alerts-slack-test" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "functionapp" -> (known after apply)
      ~ name                                           = "alerts-slack-test" -> "alerts-slack-perftest" # forces replacement
      ~ outbound_ip_address_list                       = [
          - "20.77.133.152",
          - "20.77.133.222",
          - "20.77.134.6",
          - "20.77.134.40",
          - "20.77.134.49",
          - "20.77.134.75",
          - "20.162.152.43",
          - "20.162.152.91",
          - "20.162.152.95",
          - "20.162.152.135",
          - "20.162.152.170",
          - "20.162.152.177",
          - "20.162.152.192",
          - "20.162.152.203",
          - "20.162.152.218",
          - "20.162.152.224",
          - "20.162.152.232",
          - "20.162.152.236",
          - "20.90.134.34",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "20.77.133.152,20.77.133.222,20.77.134.6,20.77.134.40,20.77.134.49,20.77.134.75,20.162.152.43,20.162.152.91,20.162.152.95,20.162.152.135,20.162.152.170,20.162.152.177,20.162.152.192,20.162.152.203,20.162.152.218,20.162.152.224,20.162.152.232,20.162.152.236,20.90.134.34" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "20.77.133.152",
          - "20.77.133.222",
          - "20.77.134.6",
          - "20.77.134.40",
          - "20.77.134.49",
          - "20.77.134.75",
          - "20.162.152.43",
          - "20.162.152.91",
          - "20.162.152.95",
          - "20.162.152.135",
          - "20.162.152.170",
          - "20.162.152.177",
          - "20.162.152.192",
          - "20.162.152.203",
          - "20.162.152.218",
          - "20.162.152.224",
          - "20.162.152.232",
          - "20.162.152.236",
          - "20.77.134.94",
          - "20.77.134.116",
          - "20.77.134.125",
          - "20.77.134.167",
          - "20.77.134.249",
          - "20.77.135.9",
          - "20.77.135.88",
          - "20.77.135.96",
          - "20.77.135.129",
          - "20.77.135.152",
          - "20.77.135.165",
          - "20.77.135.218",
          - "20.77.135.222",
          - "20.77.135.230",
          - "20.77.135.235",
          - "20.77.135.245",
          - "20.162.152.7",
          - "20.162.152.20",
          - "20.162.152.43",
          - "20.162.152.91",
          - "20.162.152.95",
          - "20.162.152.135",
          - "20.162.152.170",
          - "20.162.152.177",
          - "20.162.152.192",
          - "20.162.152.203",
          - "20.162.152.218",
          - "20.162.152.224",
          - "20.162.152.232",
          - "20.162.152.236",
          - "20.162.155.9",
          - "20.162.155.69",
          - "20.162.155.90",
          - "20.162.155.128",
          - "20.162.155.129",
          - "20.162.155.151",
          - "20.90.134.34",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "20.77.133.152,20.77.133.222,20.77.134.6,20.77.134.40,20.77.134.49,20.77.134.75,20.162.152.43,20.162.152.91,20.162.152.95,20.162.152.135,20.162.152.170,20.162.152.177,20.162.152.192,20.162.152.203,20.162.152.218,20.162.152.224,20.162.152.232,20.162.152.236,20.77.134.94,20.77.134.116,20.77.134.125,20.77.134.167,20.77.134.249,20.77.135.9,20.77.135.88,20.77.135.96,20.77.135.129,20.77.135.152,20.77.135.165,20.77.135.218,20.77.135.222,20.77.135.230,20.77.135.235,20.77.135.245,20.162.152.7,20.162.152.20,20.162.152.43,20.162.152.91,20.162.152.95,20.162.152.135,20.162.152.170,20.162.152.177,20.162.152.192,20.162.152.203,20.162.152.218,20.162.152.224,20.162.152.232,20.162.152.236,20.162.155.9,20.162.155.69,20.162.155.90,20.162.155.128,20.162.155.129,20.162.155.151,20.90.134.34" -> (known after apply)
      ~ resource_group_name                            = "alerts-slack-test" -> "alerts-slack-perftest" # forces replacement
      ~ service_plan_id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/alerts-slack-test/providers/Microsoft.Web/serverFarms/alerts-slack-test" -> (known after apply)
      ~ site_credential                                = (sensitive value)
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "alertsslacktest" -> "alertsslackperftest"
        tags                                           = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
            "startupMode"  = "always"
        }
      + zip_deploy_file                                = (known after apply)
        # (12 unchanged attributes hidden)

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/alerts-slack-test/providers/Microsoft.ManagedIdentity/userAssignedIdentities/alerts-slack-test",
            ] -> (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ site_config {
          ~ always_on                              = false -> (known after apply)
          ~ app_scale_limit                        = 200 -> (known after apply)
          ~ application_insights_connection_string = (sensitive value)
          ~ default_documents                      = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled         = false -> (known after apply)
          ~ elastic_instance_minimum               = 0 -> (known after apply)
          ~ health_check_eviction_time_in_min      = 0 -> (known after apply)
          ~ pre_warmed_instance_count              = 0 -> (known after apply)
          ~ remote_debugging_version               = "VS2019" -> (known after apply)
          - runtime_scale_monitoring_enabled       = false -> null
          ~ scm_type                               = "VSTSRM" -> (known after apply)
          + windows_fx_version                     = (known after apply)
          ~ worker_count                           = 1 -> (known after apply)
            # (11 unchanged attributes hidden)

          ~ application_stack {
              ~ use_custom_runtime          = false -> (known after apply)
              ~ use_dotnet_isolated_runtime = false -> (known after apply)
                # (2 unchanged attributes hidden)
            }
        }
    }

  # module.application_insights.azurerm_application_insights.this must be replaced
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "e545a953-b999-4d40-bfd9-b92ee100df90" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/alerts-slack-test/providers/microsoft.insights/components/alerts-test" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "alerts-test" -> "alerts-perftest" # forces replacement
      ~ resource_group_name                   = "alerts-slack-test" -> "alerts-slack-perftest" # forces replacement
        tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
            "startupMode"  = "always"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 7 to add, 0 to change, 7 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"","Target":"cft_test","Vars":{}} -->